Revit 2024 API
RebarFreeFormAccessor.IsUnconstrained Method
 Returns true if the current rebar doesn't contains a valid server GUID, or contains a valid server GUID and no valid constraints.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public bool IsUnconstrained()
Visual Basic
Public Function IsUnconstrained As Boolean
Visual C++
public:
bool IsUnconstrained()
Return Value
 Returns true if the current rebar doesn't contains a valid server GUID, or contains a valid server GUID and no valid constraints. Returns false if the current rebar contains a valid server GUID and has valid constraints.
See Also
RebarFreeFormAccessor Class
Autodesk.Revit.DB.Structure Namespace